import { useEffect } from 'react';
import "../styles/style.css";
import scissors from "../assets/scissors.png";
import scissors1 from "../assets/scissors1.png";
import needle from "../assets/needle.png";
import logo from "../assets/logo.png";


function Home() {

  useEffect(() => {

    const items = document.querySelectorAll('.floating-item');
    const screenWidth = window.innerWidth;
    const screenHeight = window.innerHeight;

    items.forEach(item => {
      const random = Math.random() * (1.4 - 1.0) + 1.0;
      item.style.height = `${(5 * random)}rem`;
      moveRandomly(item);
      item.style.animationDelay = `${Math.random() * 5}s`;
    });

    function moveRandomly(el) {
      const x = Math.random() * (screenWidth - 100);
      const y = Math.random() * (screenHeight - 100);
      el.style.left = `${x}px`;
      el.style.top = `${y}px`;
      setTimeout(() => moveRandomly(el), 10000);
    }

  }, []);

  return (
    <>         

    <div className="floating-items"> 
        <img src={scissors} alt="ножиці" className="floating-item"/> 
        <img src={scissors1} alt="ножиці" className="floating-item"/> 
        <img src={needle} alt="голка" className="floating-item"/> 
    </div>

    <main className="hero"> 
        <section id="goal-section">
            <h2>🎯 Мета створення сайту</h2>
            <ol type="I">
                <li>Надати користувачам зручний доступ до каталогу сервісів і послуг, забезпечуючи інтуїтивно зрозумілу навігацію та пошук необхідної інформації.</li>
                <li>Забезпечити можливість отримання зворотного зв’язку та консультацій від представників сервісу для підвищення якості обслуговування.</li>
                <li>Створити єдину платформу для ознайомлення з характеристиками, актуальними цінами, відгуками та контактною інформацією про кожен доступний сервіс.</li>
                <li>Забезпечити можливість отримання зворотного зв’язку та консультацій від представників сервісу для підвищення якості обслуговування.</li>
                <li>Створити єдину платформу для ознайомлення з характеристиками, актуальними цінами, відгуками та контактною інформацією про кожен доступний сервіс.</li>
            </ol>
        </section>

        <section id="info-table">
            <h2>Типи сервісів</h2>
            <table>
                <thead>
                    <tr>
                      <th>Тип сервісу</th>
                      <th>Опис</th>
                      <th>Приклади послуг</th>
                    </tr>
                </thead>
                <tbody>
                    <tr>
                        <td>Пошиття одягу</td>
                        <td>Індивідуальне виготовлення та ремонт одягу на замовлення</td>
                        <td>Пошиття костюмів, ремонт швів, підгонка за розміром</td>
                    </tr>
                    <tr>
                        <td>Ремонт авто</td>
                        <td>Обслуговування та відновлення технічного стану автомобілів</td>
                        <td>Заміна масла, ремонт двигуна, фарбування кузова</td>
                    </tr>
                    <tr>
                        <td>Ремонт оргтехніки</td>
                        <td>Діагностика та усунення несправностей офісної техніки</td>
                        <td>Ремонт принтерів, обслуговування комп’ютерів, чистка ноутбуків</td>
                    </tr>
                    <tr>
                        <td>Виготовлення виробів</td>
                        <td>Створення товарів ручної роботи або на замовлення</td>
                        <td>Виготовлення меблів, сувенірів, 3D-друк виробів</td>
                    </tr>
                </tbody>
            </table>
        </section>

        <section id="contacts-section">
            <h3>Адреса, контактні телефони.</h3>
            <p><b>Адреса:</b> <i>вул. Хрещатик 19</i></p>
            <p><b>Телефон:</b> +38 066 321 5225</p>
            <p><b>Телеграм:</b> <u>@qwerty</u></p>
        </section>

        <section className="buttons-section">
            <button>Перейти у власний кабінет</button>
            <button>Зареєструватись</button>
        </section>
    </main>
    </>
  )
}

export default Home